bad
worst
great
waste
awful
excellent
best
no
terrible
love
nothing
worse
boring
wonderful
even
of_best
stupid
of_worst
well
horrible
minutes
poor
at_all
perfect
crap
so_bad
also
money
plot
amazing
loved
supposed
very
just
one_of
beautiful
avoid
script
ridiculous
why
not_even
highly
poorly
acting
life
favorite
superb
1
only
lame
brilliant
annoying
wasted
pathetic
pointless
instead
enjoyed
cheap
today
must_see
save
dull
oh
both
always
unless
any
don't
will
laughable
very_well
could
years
least
fantastic
2
badly
world
or
fails
still
couldn't
heart
mess
make
performance
performances
to_make
definitely
how_bad
garbage
reason
to_be
family
attempt
redeeming
avoid_this
fun
especially
anything
true
looks_like
highly_recommend
classic
job
perfectly
8
off
well_worth
touching
minutes_of
than_this
this_great
3
love_this
unfortunately
bother
wonderfully
not_worth
predictable
10_10
didn't
strong
sorry
idea
not_funny
excuse
7_10
powerful
very_good
hilarious
decent
different
unique
on_dvd
each
beautifully
7
8_10
dumb
half
own
highly_recommended
disappointing
4_10
no_sense
gem
terrific
whatsoever
would
outstanding
shows
this_piece
better
enjoy
disappointment
recommend
guess
none_of
greatest
looks
recommended
trash
incredible
masterpiece
to_sit_through
look_like
low
see
joke
3_10
this_crap
enjoyable
gives
mean
absolutely_no
ok
wooden
lives
music
unfunny
mediocre
could_been
if
9_10
only_reason
amateurish
sucks
weak
well_done
1_10
4
loved_this
dvd
attempt_at
dreadful
lousy
then
rubbish
insult
atrocious
don't_even
brilliantly
beauty
guy
wasn't
someone
this_thing
watching_this
only_good
refreshing
apparently
painful
on_this
failed
moving
delightful
first_time
oscar
wasting
hour
remotely
bunch_of
journey
realistic
not_good
either
this_mess
awesome
series
uninteresting
highly_recommend_this
bored
effects
friendship
human
sweet
simple
finest
be_funny
very_bad
as_if
or_something
played
emotions
pile
well_written
fake
bland
trying
rare
first_saw
but_this
completely
tedious
1_out
favourite
works
captures
stunning
looked
most
portrayal
2_10
embarrassing
definitely_worth
subtle
performance_as
unconvincing
liked
flat
solid
funniest
although
problem
crappy
skip_this
way_too
cliché
barely
unbelievable
enjoyed_this
stinker
okay
existent
doesn't_even
9
uninspired
dialogue
would_been
complex
point
this_just
lacks
wrong
fine
at_same
may_not
underrated
10_out
except
mst3k
tried
seemed
very_funny
stay_away
maybe
any_of
recommend_this
top_notch
same_time
7_out_of
paid
extraordinary
7_out
should
through_this
7_out_of_10
only_thing
horribly
incoherent
4_out_of_10
isn't_even
nowhere
it's_just
favorites
pretty
pretentious
of_most
3_out_of_10
clichéd
charming
experience
intense
junk
write
pretty_bad
asleep
available
looked_like
skip
times
idiotic
sucked
fast_forward
silly
honestly
brings
makes
complete
perfection
forgettable
some_sort
can't
effort
painfully
impressed
i'm_sorry
tears
8_out
appalling
bit
with_this
edge
enough
lack_of
later
relationship
helps
2_out_of_10
8_out_of
remarkable
camera
ashamed
believable
horrid
just_not
tells
unwatchable
make_movie
blame
obvious
2_out
feelings
chance
thing_about
entertaining
embarrassed
thanks
just_didn't
premise
disaster
cover
irritating
unlike
random
timeless
much_better
might
very_entertaining
tries
society
some_kind_of
flawless
often
movie_just
seconds
god
unforgettable
boredom
mildly
ludicrous
monster
of_movie
ways
hoping
together
insulting
supposedly
just_right
atmosphere
for_everyone
grade
surprised
drivel
unexpected
doesn't_work
episodes
genius
happy
effective
this_supposed
those_who
appreciated
shallow
adds
can't_wait
useless
if_want
not_enough
of_fun
poignant
nonsense
city
hooked
about_as
treat
not_recommend
ages
appreciate
first_rate
brought
potential
b_movie
not_that
cardboard
gritty
warm
exceptional
endless
freedom
tripe
that's_about
if_want_to
to_all
nicely
basically
vhs
what_makes
superbly
stupidity
seems
ugly
fascinating
turkey
nudity
to_write
this_turkey
any_of_characters
little_to
crafted
one_good
haunting
neither
obnoxious
to_see_again
but_still
let's
today's
noir
at_time
unintentionally
clichés
that_would
marvelous
become
this_best
keeps
wanted_to_like
thin
truly
gore
otherwise
find
writers
come_on
just_great
tragic
on_on
of_war
grade_d
unusual
straight_to
they're
just_doesn't
downhill
should_never
what_thinking
compelling
worthless
very_disappointed
below
below_average
delivers
suppose
paint
if_this
unrealistic
easy
care
thought_provoking
mystery_science
pleasantly_surprised
zombies
wonder
sometimes
should_been
surprisingly
can_relate
if_had
rest
themes
screaming
confusing
how_not_to
extremely_well
would_love_to
rip_off_of
disappointed
stick_to
tony
promising
as_good
watchable
looking
care_about
walked
two_hours
miscast
unintentional
9_out_of_10
absurd
shoot
producers
overlooked
seagal
too_many
attempts_at
going_for
unnecessary
ruined
dimensional
disjointed
t
pleasure
deals_with
embarrassment
bore
provides
far_too
just_isn't
stock_footage
not_very
matthau
really_good
others
happiness
season
f
forced
intelligent
somebody
definitely_recommend
touches
like_bad
trite
sense_of
how_not
dire
bothered
lacked
sub_par
first_of_all
not_much
repetitive
say_about
shows_that
be_missed
moronic
traditional
fell_asleep
very_little
everyday
not_very_good
sake
joy_to
no_chemistry
makers
only_saving
must_for
chilling
be_disappointed
light
sharp
power_of
even_better
at_first
release
reality
touch
nice
on_edge_of
quiet
saving
plan_9
bottom_of
raw
strength
more_like
no_apparent
doing
scientist
offensive
nevertheless
shots_of
dreams
back_in
value
filmmakers
might_been
lackluster
other_than
dumbest
fast_paced
riveting
like_watching
some
creature
lifeless
reason_for
generous
boll
one_dimensional
spectacular
remembered
thumbs_up
satisfying
insipid
plenty_of
it's_very
sadly
excellently
yawn
had_high
film_school
embarrassingly
viewings
as_good_as
mistake
walking_around
future
1_2_from
surprising
little_film
good
really_wanted_to
advice
would_not_recommend
be_good
to_begin_with
in_lives
what_point_of
so_real
first_off
doesn't_help
moved
not_recommended
just_wasn't
subtitles
writing
follows
twists
cash_in
feel
not_one
not_make
felt_like
at_times
dramas
sensitive
doesn't_make
deserves
courage
blah
liked_this
alright
innocent
unfolds
bond
this_junk
some_of
if_want_to_see
outer_space
olds
only_complaint
something_better
familiar
shelf
credibility
paper
situation
pleasant
hardly
this_very_good
give_break
deeper
hard_to
consequences
been_done
interesting_but
lacking
who_made_this
most_memorable
simplicity
accent
drags
far
steals_show
wouldn't_recommend
generic
to_work_with
based_on_true_story
hackneyed
main_problem
sort
bravo
incompetent
sisters
louis
just_as
worth_seeing
plus_side
actors
realism
failure
biggest_problem
tiresome
to_believe
in_way
awake
hated
original
pleased
should_see
too_much
deliciously
ultimate
troubled
on_plus_side
this_travesty
caught
bothered_to
essential
sit_back
than_most
but_why
succeeds
restored
master
story_told
dream
i'm_afraid
time_watch
knowing
ideal
call_that
not_enough_to
be_seen
may_seem
glorious
wearing
slow
inexplicably
lot
run_around
oh_wait
for_actors
cannibal
revolting
unappealing
astonishing
blood
spot_on
left
did_not
prince
europe
if_don't
not_in_good
in_grave
frankly
simply_not
one_star
we're_supposed_to
how_did
ride
hype
don't_even_get_started
total_lack
to_recommend
dreary
surprisingly_good
annoyed
can_watch
didn't_work
most_of_movie
give_3
result
eerie
one_of_better
present
let_down
without_being
this_guy
if_don't_like
franchise
timing
no_where
every_time_watch
carries
more_movies
fellow
exciting
flimsy
of_laughs
stilted
scary_movie
brazil
director
complaint
even_close_to
not_typical
even_less
if_must
fears
even_though
this_dull
vapid
lazy
of_what
rules
explained
make_out
of_interest
material
holds_up
maybe_if
of_budget
seem_to
inaccurate
not_just
only_problem
detract
shame
little_slow
preposterous
in_woods
back_enjoy
relax
at_best
to_help
works_well
ed
worlds
around_like
work_of_art
gradually
than_many
hope_to_see
something_good
this_fine
film_works
say_didn't
christian
secondly
odyssey
of_this_movie
marvellous
humanity
disbelief
current
waiting_for_something
blatant
isn't_much
might_not
deal_with
inappropriate
third_rate
tolerable
get_copy
remake
motions
dvd_or
patient
this_episode
dvd_cover
hong_kong
able_to
facing
then_will
lost_interest
mummy
cerebral
appeared_to
not_only
i'm_all_for
give_4
bible
fine_film
would've
this_not_one
pass
than_any
ineffective
rounded
impression_that
stopped_watching
but_not_much
just_seems
victims
delicious
pedestrian
ham
presumably
just_enjoy
padding
walsh
dirty_harry
glad
worth
in_u.s
more_entertaining
edie
jack
so_disappointed
what_little
tired
really_disappointed
wanting_more
conveniently
tried_to_be
clothes
to_buy
most_people
christians
robert_ryan
not_one_of
example
seamlessly
having_sex
urban
entire
easily
might_enjoy
no_nonsense
half_hearted
dirty
gave_up
until
norris
in_movie
7.5
madsen
there_some_good
